--[[
	Расширенная математическая библиотека
]]
local _math = {}

--[[
	Число *e*
]]
_math.e = 2.7182818284590452353602874713526624977572470936999595749669676277240766303535475945713821785251664274274663919320030599218174135966290435729003342952605956307381323286279434907632338298807531952510190115738341879307021540891499348841675092447614606680822648001684774118537423454424371075390777449920695517027618386062613313845830007520449338265602976067371132007093287091274437470472306969772093101416928368190255151086574637721112523897844250569536967707854499699679468644549059879316368892300987931277361782154249992295763514822082698951936680331825288693984964651058209392398294887933203625094431173012381970684161403970198376793206832823764648042953118023287825098194558153017567173613320698112509961818815930416903515988885193458072738667385894228792284998920868058257492796104841984443634632449684875602336248270419786232090021609902353043699418491463140934317381436405462531520961836908887070167683964243781405927145635490613031072085103837505101157477041718986106873969655212671546889570350354

--[[
	Натуральный логарифм
]]
function _math.ln(n: number): number
	return math.log(n, _math.e)
end

--[[
	Кеш факториалов

	не трогайте ручками его!
]]
_math.factoialCache = {
	[0] =	1,	-- 0!
	[1] =	1,	-- 1!
	[2] =	2,	-- 2!
	[3] =	6,	-- 3!
	[4] =	24,	-- 4!
	[5] =	120,	-- 5!
	[6] =	720,	-- 6!
	[7] =	5040,	-- 7!
	[8] =	40320,	-- 8!
	[9] =	362880,	-- 9!
	[10] =	3628800,	-- 10!
	[11] =	39916800,	-- 11!
	[12] =	479001600,	-- 12!
	[13] =	6227020800,	-- 13!
	[14] =	87178291200,	-- 14!
	[15] =	1307674368000,	-- 15!
	[16] =	20922789888000,	-- 16!
	[17] =	355687428096000,	-- 17!
	[18] =	6402373705728000, 	-- 18!
	[19] =	121645100408832000,	-- 19!
	[20] =	2432902008176640000,	-- 20!
	[21] =	51090942171709440000	-- 21!
}

_math.defaultDelta = 0e-4

--[[
	Гамма функция

	используется интегральное определение Эйлера:

	`∫(-(ln(x))^n)dx`
]]
function _math.gamma(n: number)
	return  _math.integral(
		function(x: number): number 
			return math.pow(-_math.ln(x), n-1)
		end, 
		0, 
		1
	)
end



--[[
	Факториал

	return n!
]]
function _math.factorial(n: number): number

	if _math.factoialCache[n] ~= nil then	-- if cache not exist
		local ret
		if n % 1 == 0 then
			ret = _math.factorial(n-1) * n
		else
			ret = _math.gamma(n + 1)
		end

		_math.factoialCache[n] = ret
		
		return ret
	else
		return _math.factoialCache[n]
	end

end

--[[
	корень произвольной степени
]]
function _math.root(n: number, base: number): number 
	return math.pow(n, 1 / base)
end

--[[
	Вычисление интеграла от a до b

	>  ∫f(x)dx

	delta ≠ 0
]]
function _math.integral(f: (x: number)->number, a: number, b: number, delta: number?): number
	assert(delta > 0)

	local n = 0
	local _delta = delta or _math.defaultDelta

	for i = a, b, _delta do
		b += f(i) * _delta
	end

	return n
end

return _math
